Repository: sashavipro/SwipeBot
Catalog: src/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Welcome back, {name}! Select an action:
ru: Добро пожаловать в Swipe! Выберите действие:

source: Welcome to Swipe! Select:
ru: Добро пожаловать в Swipe! Выберите:

source: Select the interface language:
ru: Выберите язык интерфейса:

source: Welcome to Swipe! Select an action:
ru: Добро пожаловать в Swipe! Выберите действие:

source: Language changed!
ru: Язык изменился!

source: Select an action:
ru: Добро пожаловать в Swipe! Выберите действие:

source: Cancel
ru: Отмена

source: You have successfully logged out.
ru: **Успешно вошли в систему!**

source: **Swipe Bot Help** /start - Main Menu /profile - My Profile If you found a bug, please contact support.
ru: **Справка по Swipe Bot** /start - Главное меню /profile - Мой профиль Если вы обнаружили ошибку, пожалуйста, обратитесь в службу поддержки.

source: You are not logged in. Please login first.
ru: Вы не вошли в систему. Пожалуйста, войдите в систему сначала.

source: **My Profile Mode**
ru: Мой профиль

source: **Personal Info:** Name: {first} {last} Email: {email} Phone: {phone}
ru: **Личная информация:** Имя: {first} {last} Электронная почта: {email} Телефон: {phone}

source: Your session has expired. Please log in again.
ru: Ваша сессия истекла. Пожалуйста, войдите снова.

source: An error occurred: {error}
ru: Ошибка: {error}

source: Back to Menu
ru: Вернуться к меню

source: **Create New Listing** Step 1/7: Enter the **Address** (e.g. Baker St, 221B):
ru: **Создать новую объявление** Шаг 1/7: Введите **адрес** (например, Бейкер-стрит, 221Б):

source: Step 2/7: Enter **Apartment Number**:
ru: Шаг 2/7: Введите **номер квартиры**:

source: Back
ru: Назад

source: Step 1/7: Enter the **Address**:
ru: Шаг 1/7: Введите **адрес**:

source: Step 3/7: Enter **Price** ($):
ru: Шаг 3/7: Введите **Цена** ($):

source: Please enter a valid number for price.
ru: Введите действительный номер для цены.

source: Step 4/7: Enter **Area** (sq. m):
ru: Шаг 4/7: Введите **Площадь** (кв. м):

source: Please enter a valid number for area.
ru: Введите действительный номер для данного региона.

source: Step 5/7: Enter **Description**:
ru: Шаг 5/7: Введите **Описание**:

source: Step 6/7: Share **Location** using the button below:
ru: Шаг 6/7: Поделитесь **местоположением** с помощью кнопки ниже:

source: Step 7/7: Send **Photos** (one by one or album). Press **Done** when finished.
ru: Шаг 7/7: Отправить **фотографии** (по одной или альбом). По завершении нажмите **Готово**.

source: Failed to process image.
ru: Не удалось обработать изображение.

source: Done
ru: Готово

source: Please send at least one photo.
ru: Пожалуйста, пришлите хотя бы одну фотографию.

source: Creating listing...
ru: Создать объявление

source: **Listing created successfully!**
ru: **Объявление создано успешно!**

source: Session expired. Please login again.
ru: Ваша сессия истекла. Пожалуйста, войдите снова.

source: Failed to create listing: {error}
ru: Не удалось создать объявление: {error}

source: No contact info
ru: Нет контактной информации

source: <b>MY LISTING</b>
ru: <b>МОЙ СПИСОК</b>

source: Error loading listings.
ru: Ошибка: {error}

source: No more listings.
ru: Создать объявление

source: You haven't created any listings yet.
ru: Вы еще не создали ни одного объявления.

source: No listings found.
ru: Список объявлений

source: **Announcement Page {page}**
ru: Режим объявления

source: Invalid coordinates.
ru: Недопустимые данные координат.

source: Location not found for this item.
ru: Геолокация не установлена для этого объявления.

source: Welcome back! Select an action:
ru: Добро пожаловать в Swipe! Выберите действие:

source: Please enter your **Email**:
ru: Введите свой **адрес электронной почты**:

source: Invalid email format. Try again:
ru: Неверный формат адреса электронной почты. Повторите попытку:

source: Enter your **Password**:
ru: Введите свой **пароль**:

source: Forgot Password?
ru: Забыли пароль?

source: Logging in...
ru: Вход в систему...

source: **Successfully logged in!**
ru: **Успешно вошли в систему!**

source: Login failed: {error}
ru: Не удалось войти: {error}

source: **Registration Step 1/5** Enter your **First Name**:
ru: **Регистрация, шаг 1 из 5** Введите свое **Имя**:

source: Registration canceled.
ru: Регистрация отменена

source: Enter your **First Name**:
ru: Введите свое **имя**

source: Enter your **Last Name**:
ru: Введите свою **фамилию**:

source: **Step 4/5** Share your **Phone Number** using the button below or type it manually (+123...):
ru: **Шаг 4/5** Поделитесь своим **номером телефона**, нажав кнопку ниже, или введите его вручную. (+123...):

source: Too short. Please enter real First Name:
ru: Слишком короткое. Введите настоящее имя:

source: **Step 2/5** Enter your **Last Name**:
ru: **Шаг 2/5** Введите свою **фамилию**:

source: **Step 3/5** Enter your **Email**:
ru: **Шаг 3/5** Введите свой **адрес электронной почты**:

source: Invalid phone format. Please use +123456789.
ru: Неверный формат телефона. Пожалуйста, используйте +123456789.

source: **Step 5/5** Create a **Password** for your account:
ru: **Шаг 5/5** Создайте **пароль** для своей учетной записи:

source: Password must be at least 6 characters.
ru: Пароль должен состоять как минимум из 6 символов.

source: Sending data to server...
ru: Отправка данных на сервер...

source: Data accepted! We sent a verification code to **{email}**. **Enter the code below:**
ru: Данные приняты! Мы отправили код подтверждения на **{email}**. **Введите код ниже:**

source: **You are already registered!** Please log in.
ru: **Вы уже зарегистрированы!** Пожалуйста, войдите в систему.

source: Registration failed: {error} Please try changing data or cancel.
ru: Регистрация не удалась: {error} Попробуйте изменить данные или отменить.

source: **Registration Successful!** User: {first} {last} {email} {phone} Password: <tg-spoiler>{password}</tg-spoiler> You are now logged in!
ru: **Registration Successful!** Пользователь: {first} {last} {email} {phone} Вы сейчас вошли в систему!

source: Code verification failed: {error}. Check code and try again:
ru: Проверка кода не удалась: {error}. Проверьте код и попробуйте еще раз:

source: **Password Reset** Enter your **Email**:
ru: **Сброс пароля** Введите свой **адрес электронной почты**:

source: Code sent. **Enter the code:**
ru: Код отправлен. **Введите код:**

source: Error: {error}
ru: Ошибка: {error}

source: Code accepted. **Enter NEW password:**
ru: Код принят. **Введите НОВЫЙ пароль:**

source: Password updated! Login now.
ru: Пароль обновлен! Войдите сейчас.

source: Location
ru: Вход

source: Listings
ru: Список объявлений

source: Create Listing
ru: Создать объявление

source: My Profile
ru: Мой профиль

source: Logout
ru: Выход из системы

source: My Listings
ru: Список объявлений

source: Login
ru: Вход

source: Registration
ru: Регистрация

source: Share Location
ru: Поделиться моими контактами

source: Share my contact
ru: Поделиться моими контактами

source: Cancel Registration
ru: Отменить регистрацию

source: Main Menu:
ru: Главное меню:
